In [1]:
import numpy as np
import pandas as pd
#pandas is defined as an open-source librarythat provides high-performance data manipulation in python 
#data analysis requires lot of processing such as restructing,cleaning,mergin,manipulating etc..we prefer pandas to perform
#above functionalities bcoz it is fast,simple than other tasks
#pandas is built on numpy is required for operating pandas

In [2]:
#pandas series
#panda series is a data structure with 1 dimensional labelled array
#it is a primary building block of dataframe,making its rows and columns

In [3]:
import numpy as np
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':100,'b':200,'c':300}
arr

array([10, 20, 30])

In [4]:
#syntax->pandas.series(data=none,index=none,dtype=none,name=none,copy=True(or)False)

In [10]:
#ex-1
import pandas as pd
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
type(pd.Series(my_data))

pandas.core.series.Series

In [12]:
#Series with labels
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=[print,len,sum])

0    <built-in function print>
1      <built-in function len>
2      <built-in function sum>
dtype: object

In [14]:
class profile:
    # @property
    def display(self):
        print("My name is valli")
p=profile()
p.display()

My name is valli

In [15]:
def decor(func):
    def inner():
        str1=func()
        return str1.upper()
    return inner()
def greet():
    return "good morning"
print(greet())

good morning

In [16]:
ser1=pd.Series([1,2,3,4,5],["USA","India","Canada","UK","Egypt"])
ser1

USA       1
India     2
Canada    3
UK        4
Egypt     5
dtype: int64

In [19]:
ser1["UK"]

4

In [20]:
#access values using indexing
ser1[0:3]

USA       1
India     2
Canada    3
dtype: int64

In [27]:
ser2=pd.Series([6,7,8,9,10],["Brazil","Africa","Australia","USA","UK"])
ser1+ser2

Africa        NaN
Australia     NaN
Brazil        NaN
Canada        NaN
Egypt         NaN
India         NaN
UK           14.0
USA          10.0
dtype: float64

In [33]:
#to create a new data in series
ser2['china']="duplicate"
ser2

Brazil               6
Africa               7
Australia            8
USA                  9
UK                  10
china        duplicate
dtype: object

In [34]:
#to delete a data from series
ser2.drop('USA')

Brazil               6
Africa               7
Australia            8
UK                  10
china        duplicate
dtype: object

In [40]:
#dataframe
#pd.dataframe(data,row_label,clo_label)
import numpy as np
df=pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0 -0.311923  0.336077  0.565281 -0.330088
1  0.800750 -0.252678  0.317124  0.898960
2  0.606884 -0.451261 -2.812726  0.391861
3 -2.084577 -0.780843 -1.267199 -0.702402
4 -0.664388 -0.929049  0.881507  1.092361

In [61]:
df=pd.DataFrame(np.random.randn(5,4),['a','b','c','d','e'],['w','x','y','z'])
df

          w         x         y         z
a  0.536119  2.208896  0.086822  0.339726
b  0.000995 -0.099379  0.970779 -0.309297
c  0.648031  0.041035 -2.308424 -1.668319
d  0.235921  0.186527 -1.254620  0.040680
e -0.338453 -0.084315 -0.859668  0.614567

In [45]:
#to convert dictionary to dataframes
d={"col1":[1,2],"clo2":[3,4],"clo3":[5,6]}
df=pd.DataFrame(data=d)
df

   col1  clo2  clo3
0     1     3     5
1     2     4     6

In [46]:
df=pd.DataFrame(d,['row1','row2'])
df

      col1  clo2  clo3
row1     1     3     5
row2     2     4     6

In [47]:
df

      col1  clo2  clo3
row1     1     3     5
row2     2     4     6

In [50]:
df

          w         x         y         z
a  1.413740  0.741756 -0.150080  0.724301
b -0.630726 -2.060869  0.709531 -0.753072
c  0.451260  0.087241  0.034937 -0.699543
d  0.003782  0.959838  2.210472 -0.393216
e -0.556607 -0.374348 -1.140507 -1.428306

In [51]:
df.T

          a         b         c         d         e
w  1.413740 -0.630726  0.451260  0.003782 -0.556607
x  0.741756 -2.060869  0.087241  0.959838 -0.374348
y -0.150080  0.709531  0.034937  2.210472 -1.140507
z  0.724301 -0.753072 -0.699543 -0.393216 -1.428306

In [52]:
df.index#-->get all the row name

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [53]:
df.columns

Index(['w', 'x', 'y', 'z'], dtype='object')

In [54]:
type(df)

pandas.core.frame.DataFrame

In [55]:
df.dtypes

w    float64
x    float64
y    float64
z    float64
dtype: object

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       5 non-null      float64
 1   x       5 non-null      float64
 2   y       5 non-null      float64
 3   z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [57]:
df.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object'),
 Index(['w', 'x', 'y', 'z'], dtype='object')]

In [58]:
df.values

array([[ 1.41373975,  0.74175605, -0.1500805 ,  0.72430122],
       [-0.63072631, -2.06086885,  0.70953116, -0.75307224],
       [ 0.45126033,  0.08724133,  0.03493715, -0.69954252],
       [ 0.00378156,  0.95983758,  2.21047229, -0.39321611],
       [-0.55660687, -0.37434777, -1.14050668, -1.4283056 ]])

In [59]:
df.size

20

In [60]:
df.ndim

2

In [72]:

df

          w         x         y         z
a  0.536119  2.208896  0.086822  0.339726
b  0.000995 -0.099379  0.970779 -0.309297
c  0.648031  0.041035 -2.308424 -1.668319
d  0.235921  0.186527 -1.254620  0.040680
e -0.338453 -0.084315 -0.859668  0.614567

In [66]:
#to access specific column in df
df['w']

a    0.536119
b    0.000995
c    0.648031
d    0.235921
e   -0.338453
Name: w, dtype: float64

In [71]:
df{['w','x']}

SyntaxError: invalid syntax (2850186167.py, line 1)

In [73]:
df

          w         x         y         z
a  0.536119  2.208896  0.086822  0.339726
b  0.000995 -0.099379  0.970779 -0.309297
c  0.648031  0.041035 -2.308424 -1.668319
d  0.235921  0.186527 -1.254620  0.040680
e -0.338453 -0.084315 -0.859668  0.614567

In [74]:
df{['w','y']}

SyntaxError: invalid syntax (4002840733.py, line 1)

In [75]:
#to create a new column
df['new']=df['w']+df['y']
df

          w         x         y         z       new
a  0.536119  2.208896  0.086822  0.339726  0.622941
b  0.000995 -0.099379  0.970779 -0.309297  0.971774
c  0.648031  0.041035 -2.308424 -1.668319 -1.660393
d  0.235921  0.186527 -1.254620  0.040680 -1.018699
e -0.338453 -0.084315 -0.859668  0.614567 -1.198120

In [77]:
df.drop('new',axis=1)

          w         x         y         z
a  0.536119  2.208896  0.086822  0.339726
b  0.000995 -0.099379  0.970779 -0.309297
c  0.648031  0.041035 -2.308424 -1.668319
d  0.235921  0.186527 -1.254620  0.040680
e -0.338453 -0.084315 -0.859668  0.614567

In [79]:
df.drop('new',axis=1,implace=True)
df

TypeError: DataFrame.drop() got an unexpected keyword argument 'implace'